interfaceFindAndTopoSet/testCase/constant/vectorDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       dictionary;
    location    "constant";
    object      vectorDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

test3
{
    name1           Ruan;
    name2
    {
        test1           test1;
        test2           test2;
    }
}

Dict1           5 ( { test1 test1 ; test2 test2 ; } { test1 test1 ; test2 test2 ; } { test1 test1 ; test2 test2 ; } { test1 test1 ; test2 test2 ; } { test3 { name1 Ruan ; name2 { test1 test1 ; test2 test2 ; } } } );


// ************************************************************************* //
